thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MC806.h
extern volatile DMA7STBHBITS DMA7STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA7PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA7CNT __attribute__((__sfr__));
typedef struct tagDMA7CNTBITS {
  unsigned CNT:14;
} DMA7CNTBITS;
extern volatile DMA7CNTBITS DMA7CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA8CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA8CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA8CONBITS;
extern volatile DMA8CONBITS DMA8CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA8REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA8REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA8REQBITS;
extern volatile DMA8REQBITS DMA8REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA8STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA8STAH __attribute__((__sfr__));
typedef struct tagDMA8STAHBITS {
  unsigned STA:8;
} DMA8STAHBITS;
extern volatile DMA8STAHBITS DMA8STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA8STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA8STBH __attribute__((__sfr__));
typedef struct tagDMA8STBHBITS {
  unsigned STB:8;
} DMA8STBHBITS;
extern volatile DMA8STBHBITS DMA8STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA8PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA8CNT __attribute__((__sfr__));
typedef struct tagDMA8CNTBITS {
  unsigned CNT:14;
} DMA8CNTBITS;
extern volatile DMA8CNTBITS DMA8CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA9CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA9CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA9CONBITS;
extern volatile DMA9CONBITS DMA9CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA9REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA9REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA9REQBITS;
extern volatile DMA9REQBITS DMA9REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA9STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA9STAH __attribute__((__sfr__));
typedef struct tagDMA9STAHBITS {
  unsigned STA:8;
} DMA9STAHBITS;
extern volatile DMA9STAHBITS DMA9STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA9STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA9STBH __attribute__((__sfr__));
typedef struct tagDMA9STBHBITS {
  unsigned STB:8;
} DMA9STBHBITS;
extern volatile DMA9STBHBITS DMA9STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA9PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA9CNT __attribute__((__sfr__));
typedef struct tagDMA9CNTBITS {
  unsigned CNT:14;
} DMA9CNTBITS;
extern volatile DMA9CNTBITS DMA9CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA10CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA10CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA10CONBITS;
extern volatile DMA10CONBITS DMA10CONbits __attribute__((__sfr__));

extern volatile unsigned int  DMA10REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA10REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA10REQBITS;
extern volatile DMA10REQBITS DMA10REQbits __attribute__((__sfr__));

extern volatile unsigned int  DMA10STAL __attribute__((__sfr__));
extern volatile unsigned int  DMA10STAH __attribute__((__sfr__));
typedef struct tagDMA10STAHBITS {
  unsigned STA:8;
} DMA10STAHBITS;
extern volatile DMA10STAHBITS DMA10STAHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA10STBL __attribute__((__sfr__));
extern volatile unsigned int  DMA10STBH __attribute__((__sfr__));
typedef struct tagDMA10STBHBITS {
  unsigned STB:8;
} DMA10STBHBITS;
extern volatile DMA10STBHBITS DMA10STBHbits __attribute__((__sfr__));

extern volatile unsigned int  DMA10PAD __attribute__((__sfr__));
extern volatile unsigned int  DMA10CNT __attribute__((__sfr__));
typedef struct tagDMA10CNTBITS {
  unsigned CNT:14;
} DMA10CNTBITS;
extern volatile DMA10CNTBITS DMA10CNTbits __attribute__((__sfr__));

extern volatile unsigned int  DMA11CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA11CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA11CONBITS;
