thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MC806.h
/* C1FIFO */
/* Bitname _FNRB cannot be defined because it is used by more than one SFR */
/* Bitname _FBP cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB2 cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB3 cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB4 cannot be defined because it is used by more than one SFR */
/* Bitname _FNRB5 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP0 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP1 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP2 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP3 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP4 cannot be defined because it is used by more than one SFR */
/* Bitname _FBP5 cannot be defined because it is used by more than one SFR */

/* C1INTF */
/* Bitname _TBIF cannot be defined because it is used by more than one SFR */
/* Bitname _RBIF cannot be defined because it is used by more than one SFR */
/* Bitname _RBOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOIF cannot be defined because it is used by more than one SFR */
/* Bitname _ERRIF cannot be defined because it is used by more than one SFR */
/* Bitname _WAKIF cannot be defined because it is used by more than one SFR */
/* Bitname _IVRIF cannot be defined because it is used by more than one SFR */
/* Bitname _EWARN cannot be defined because it is used by more than one SFR */
/* Bitname _RXWAR cannot be defined because it is used by more than one SFR */
/* Bitname _TXWAR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBP cannot be defined because it is used by more than one SFR */
/* Bitname _TXBP cannot be defined because it is used by more than one SFR */
/* Bitname _TXBO cannot be defined because it is used by more than one SFR */

/* C1INTE */
/* Bitname _TBIE cannot be defined because it is used by more than one SFR */
/* Bitname _RBIE cannot be defined because it is used by more than one SFR */
/* Bitname _RBOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOIE cannot be defined because it is used by more than one SFR */
/* Bitname _ERRIE cannot be defined because it is used by more than one SFR */
/* Bitname _WAKIE cannot be defined because it is used by more than one SFR */
/* Bitname _IVRIE cannot be defined because it is used by more than one SFR */

/* C1EC */
/* Bitname _RERRCNT cannot be defined because it is used by more than one SFR */
/* Bitname _TERRCNT cannot be defined because it is used by more than one SFR */

/* C1CFG1 */
/* Bitname _BRP cannot be defined because it is used by more than one SFR */
/* Bitname _SJW cannot be defined because it is used by more than one SFR */
/* Bitname _BRP0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP5 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW0 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW1 cannot be defined because it is used by more than one SFR */

/* C1CFG2 */
/* Bitname _PRSEG cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH cannot be defined because it is used by more than one SFR */
/* Bitname _SAM cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PHTS cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH cannot be defined because it is used by more than one SFR */
/* Bitname _WAKFIL cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG0 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG1 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH2 cannot be defined because it is used by more than one SFR */

/* C1FEN1 */
/* Bitname _FLTEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN14 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN15 cannot be defined because it is used by more than one SFR */

