thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MC806.h
/* CRCXORH */
#define _X16 CRCXORHbits.X16
#define _X17 CRCXORHbits.X17
#define _X18 CRCXORHbits.X18
#define _X19 CRCXORHbits.X19
#define _X20 CRCXORHbits.X20
#define _X21 CRCXORHbits.X21
#define _X22 CRCXORHbits.X22
#define _X23 CRCXORHbits.X23
#define _X24 CRCXORHbits.X24
#define _X25 CRCXORHbits.X25
#define _X26 CRCXORHbits.X26
#define _X27 CRCXORHbits.X27
#define _X28 CRCXORHbits.X28
#define _X29 CRCXORHbits.X29
#define _X30 CRCXORHbits.X30
#define _X31 CRCXORHbits.X31

/* RPOR0 */
#define _RP64R RPOR0bits.RP64R
#define _RP65R RPOR0bits.RP65R
#define _RP64R0 RPOR0bits.RP64R0
#define _RP64R1 RPOR0bits.RP64R1
#define _RP64R2 RPOR0bits.RP64R2
#define _RP64R3 RPOR0bits.RP64R3
#define _RP64R4 RPOR0bits.RP64R4
#define _RP64R5 RPOR0bits.RP64R5
#define _RP65R0 RPOR0bits.RP65R0
#define _RP65R1 RPOR0bits.RP65R1
#define _RP65R2 RPOR0bits.RP65R2
#define _RP65R3 RPOR0bits.RP65R3
#define _RP65R4 RPOR0bits.RP65R4
#define _RP65R5 RPOR0bits.RP65R5

/* RPOR1 */
#define _RP66R RPOR1bits.RP66R
#define _RP67R RPOR1bits.RP67R
#define _RP66R0 RPOR1bits.RP66R0
#define _RP66R1 RPOR1bits.RP66R1
#define _RP66R2 RPOR1bits.RP66R2
#define _RP66R3 RPOR1bits.RP66R3
#define _RP66R4 RPOR1bits.RP66R4
#define _RP66R5 RPOR1bits.RP66R5
#define _RP67R0 RPOR1bits.RP67R0
#define _RP67R1 RPOR1bits.RP67R1
#define _RP67R2 RPOR1bits.RP67R2
#define _RP67R3 RPOR1bits.RP67R3
#define _RP67R4 RPOR1bits.RP67R4
#define _RP67R5 RPOR1bits.RP67R5

/* RPOR2 */
#define _RP68R RPOR2bits.RP68R
#define _RP69R RPOR2bits.RP69R
#define _RP68R0 RPOR2bits.RP68R0
#define _RP68R1 RPOR2bits.RP68R1
#define _RP68R2 RPOR2bits.RP68R2
#define _RP68R3 RPOR2bits.RP68R3
#define _RP68R4 RPOR2bits.RP68R4
#define _RP68R5 RPOR2bits.RP68R5
#define _RP69R0 RPOR2bits.RP69R0
#define _RP69R1 RPOR2bits.RP69R1
#define _RP69R2 RPOR2bits.RP69R2
#define _RP69R3 RPOR2bits.RP69R3
#define _RP69R4 RPOR2bits.RP69R4
#define _RP69R5 RPOR2bits.RP69R5

/* RPOR3 */
#define _RP70R RPOR3bits.RP70R
#define _RP71R RPOR3bits.RP71R
#define _RP70R0 RPOR3bits.RP70R0
#define _RP70R1 RPOR3bits.RP70R1
#define _RP70R2 RPOR3bits.RP70R2
#define _RP70R3 RPOR3bits.RP70R3
#define _RP70R4 RPOR3bits.RP70R4
#define _RP70R5 RPOR3bits.RP70R5
#define _RP71R0 RPOR3bits.RP71R0
#define _RP71R1 RPOR3bits.RP71R1
#define _RP71R2 RPOR3bits.RP71R2
#define _RP71R3 RPOR3bits.RP71R3
#define _RP71R4 RPOR3bits.RP71R4
#define _RP71R5 RPOR3bits.RP71R5

/* RPOR4 */
#define _RP80R RPOR4bits.RP80R
#define _RP80R0 RPOR4bits.RP80R0
#define _RP80R1 RPOR4bits.RP80R1
#define _RP80R2 RPOR4bits.RP80R2
#define _RP80R3 RPOR4bits.RP80R3
#define _RP80R4 RPOR4bits.RP80R4
#define _RP80R5 RPOR4bits.RP80R5

/* RPOR5 */
#define _RP82R RPOR5bits.RP82R
#define _RP84R RPOR5bits.RP84R
#define _RP82R0 RPOR5bits.RP82R0
#define _RP82R1 RPOR5bits.RP82R1
#define _RP82R2 RPOR5bits.RP82R2
#define _RP82R3 RPOR5bits.RP82R3
#define _RP82R4 RPOR5bits.RP82R4
#define _RP82R5 RPOR5bits.RP82R5
#define _RP84R0 RPOR5bits.RP84R0
#define _RP84R1 RPOR5bits.RP84R1
#define _RP84R2 RPOR5bits.RP84R2
#define _RP84R3 RPOR5bits.RP84R3
#define _RP84R4 RPOR5bits.RP84R4
#define _RP84R5 RPOR5bits.RP84R5

/* RPOR6 */
#define _RP85R RPOR6bits.RP85R
#define _RP87R RPOR6bits.RP87R
#define _RP85R0 RPOR6bits.RP85R0
#define _RP85R1 RPOR6bits.RP85R1
#define _RP85R2 RPOR6bits.RP85R2
#define _RP85R3 RPOR6bits.RP85R3
#define _RP85R4 RPOR6bits.RP85R4
#define _RP85R5 RPOR6bits.RP85R5
#define _RP87R0 RPOR6bits.RP87R0
#define _RP87R1 RPOR6bits.RP87R1
#define _RP87R2 RPOR6bits.RP87R2
#define _RP87R3 RPOR6bits.RP87R3
#define _RP87R4 RPOR6bits.RP87R4
#define _RP87R5 RPOR6bits.RP87R5

/* RPOR7 */
#define _RP96R RPOR7bits.RP96R
#define _RP97R RPOR7bits.RP97R
#define _RP96R0 RPOR7bits.RP96R0
#define _RP96R1 RPOR7bits.RP96R1
#define _RP96R2 RPOR7bits.RP96R2
#define _RP96R3 RPOR7bits.RP96R3
#define _RP96R4 RPOR7bits.RP96R4
#define _RP96R5 RPOR7bits.RP96R5
#define _RP97R0 RPOR7bits.RP97R0
#define _RP97R1 RPOR7bits.RP97R1
#define _RP97R2 RPOR7bits.RP97R2
#define _RP97R3 RPOR7bits.RP97R3
#define _RP97R4 RPOR7bits.RP97R4
#define _RP97R5 RPOR7bits.RP97R5

/* RPOR8 */
#define _RP98R RPOR8bits.RP98R
#define _RP99R RPOR8bits.RP99R
#define _RP98R0 RPOR8bits.RP98R0
#define _RP98R1 RPOR8bits.RP98R1
#define _RP98R2 RPOR8bits.RP98R2
#define _RP98R3 RPOR8bits.RP98R3
#define _RP98R4 RPOR8bits.RP98R4
#define _RP98R5 RPOR8bits.RP98R5
#define _RP99R0 RPOR8bits.RP99R0
#define _RP99R1 RPOR8bits.RP99R1
#define _RP99R2 RPOR8bits.RP99R2
#define _RP99R3 RPOR8bits.RP99R3
#define _RP99R4 RPOR8bits.RP99R4
#define _RP99R5 RPOR8bits.RP99R5

/* RPOR9 */
#define _RP100R RPOR9bits.RP100R
#define _RP101R RPOR9bits.RP101R
#define _RP100R0 RPOR9bits.RP100R0
#define _RP100R1 RPOR9bits.RP100R1
#define _RP100R2 RPOR9bits.RP100R2
#define _RP100R3 RPOR9bits.RP100R3
#define _RP100R4 RPOR9bits.RP100R4
#define _RP100R5 RPOR9bits.RP100R5
#define _RP101R0 RPOR9bits.RP101R0
#define _RP101R1 RPOR9bits.RP101R1
#define _RP101R2 RPOR9bits.RP101R2
#define _RP101R3 RPOR9bits.RP101R3
#define _RP101R4 RPOR9bits.RP101R4
#define _RP101R5 RPOR9bits.RP101R5

/* RPOR10 */
#define _RP102R RPOR10bits.RP102R
#define _RP102R0 RPOR10bits.RP102R0
#define _RP102R1 RPOR10bits.RP102R1
#define _RP102R2 RPOR10bits.RP102R2
#define _RP102R3 RPOR10bits.RP102R3
#define _RP102R4 RPOR10bits.RP102R4
#define _RP102R5 RPOR10bits.RP102R5

/* RPOR13 */
#define _RP118R RPOR13bits.RP118R
#define _RP118R0 RPOR13bits.RP118R0
#define _RP118R1 RPOR13bits.RP118R1
#define _RP118R2 RPOR13bits.RP118R2
#define _RP118R3 RPOR13bits.RP118R3
#define _RP118R4 RPOR13bits.RP118R4
#define _RP118R5 RPOR13bits.RP118R5

/* RPOR14 */
#define _RP120R RPOR14bits.RP120R
#define _RP120R0 RPOR14bits.RP120R0
#define _RP120R1 RPOR14bits.RP120R1
#define _RP120R2 RPOR14bits.RP120R2
#define _RP120R3 RPOR14bits.RP120R3
#define _RP120R4 RPOR14bits.RP120R4
#define _RP120R5 RPOR14bits.RP120R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT3R RPINR1bits.INT3R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT3R0 RPINR1bits.INT3R0
#define _INT3R1 RPINR1bits.INT3R1
#define _INT3R2 RPINR1bits.INT3R2
#define _INT3R3 RPINR1bits.INT3R3
#define _INT3R4 RPINR1bits.INT3R4
#define _INT3R5 RPINR1bits.INT3R5
#define _INT3R6 RPINR1bits.INT3R6

/* RPINR2 */
#define _INT4R RPINR2bits.INT4R
#define _RSVR RPINR2bits.RSVR
#define _INT4R0 RPINR2bits.INT4R0
#define _INT4R1 RPINR2bits.INT4R1
#define _INT4R2 RPINR2bits.INT4R2
#define _INT4R3 RPINR2bits.INT4R3
#define _INT4R4 RPINR2bits.INT4R4
#define _INT4R5 RPINR2bits.INT4R5
#define _INT4R6 RPINR2bits.INT4R6
#define _RSVR0 RPINR2bits.RSVR0
#define _RSVR1 RPINR2bits.RSVR1
#define _RSVR2 RPINR2bits.RSVR2
#define _RSVR3 RPINR2bits.RSVR3
#define _RSVR4 RPINR2bits.RSVR4
#define _RSVR5 RPINR2bits.RSVR5
#define _RSVR6 RPINR2bits.RSVR6

