thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MC806.h
/* ANSELD */
#define _ANSD6 ANSELDbits.ANSD6
#define _ANSD7 ANSELDbits.ANSD7

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7

/* CNENE */
#define _CNIEE0 CNENEbits.CNIEE0
#define _CNIEE1 CNENEbits.CNIEE1
#define _CNIEE2 CNENEbits.CNIEE2
#define _CNIEE3 CNENEbits.CNIEE3
#define _CNIEE4 CNENEbits.CNIEE4
#define _CNIEE5 CNENEbits.CNIEE5
#define _CNIEE6 CNENEbits.CNIEE6
#define _CNIEE7 CNENEbits.CNIEE7

/* CNPUE */
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7

/* CNPDE */
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7

/* ANSELE */
#define _ANSE0 ANSELEbits.ANSE0
#define _ANSE1 ANSELEbits.ANSE1
#define _ANSE2 ANSELEbits.ANSE2
#define _ANSE3 ANSELEbits.ANSE3
#define _ANSE4 ANSELEbits.ANSE4
#define _ANSE5 ANSELEbits.ANSE5
#define _ANSE6 ANSELEbits.ANSE6
#define _ANSE7 ANSELEbits.ANSE7

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF2 TRISFbits.TRISF2
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF2 PORTFbits.RF2
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF2 LATFbits.LATF2
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1
#define _ODCF2 ODCFbits.ODCF2
#define _ODCF3 ODCFbits.ODCF3
#define _ODCF4 ODCFbits.ODCF4
#define _ODCF5 ODCFbits.ODCF5

/* CNENF */
#define _CNIEF0 CNENFbits.CNIEF0
#define _CNIEF1 CNENFbits.CNIEF1
#define _CNIEF2 CNENFbits.CNIEF2
#define _CNIEF3 CNENFbits.CNIEF3
#define _CNIEF4 CNENFbits.CNIEF4
#define _CNIEF5 CNENFbits.CNIEF5

/* CNPUF */
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1
#define _CNPUF2 CNPUFbits.CNPUF2
#define _CNPUF3 CNPUFbits.CNPUF3
#define _CNPUF4 CNPUFbits.CNPUF4
#define _CNPUF5 CNPUFbits.CNPUF5

/* CNPDF */
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1
#define _CNPDF2 CNPDFbits.CNPDF2
#define _CNPDF3 CNPDFbits.CNPDF3
#define _CNPDF4 CNPDFbits.CNPDF4
#define _CNPDF5 CNPDFbits.CNPDF5

/* TRISG */
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9

/* PORTG */
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9

/* LATG */
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9

/* ODCG */
#define _ODCG2 ODCGbits.ODCG2
#define _ODCG3 ODCGbits.ODCG3

/* CNENG */
#define _CNIEG2 CNENGbits.CNIEG2
#define _CNIEG3 CNENGbits.CNIEG3
#define _CNIEG6 CNENGbits.CNIEG6
#define _CNIEG7 CNENGbits.CNIEG7
#define _CNIEG8 CNENGbits.CNIEG8
#define _CNIEG9 CNENGbits.CNIEG9

/* CNPUG */
#define _CNPUG2 CNPUGbits.CNPUG2
#define _CNPUG3 CNPUGbits.CNPUG3
#define _CNPUG6 CNPUGbits.CNPUG6
#define _CNPUG7 CNPUGbits.CNPUG7
#define _CNPUG8 CNPUGbits.CNPUG8
#define _CNPUG9 CNPUGbits.CNPUG9

/* CNPDG */
#define _CNPDG2 CNPDGbits.CNPDG2
#define _CNPDG3 CNPDGbits.CNPDG3
#define _CNPDG6 CNPDGbits.CNPDG6
#define _CNPDG7 CNPDGbits.CNPDG7
#define _CNPDG8 CNPDGbits.CNPDG8
#define _CNPDG9 CNPDGbits.CNPDG9

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9

/* PADCFG1 */
#define _PMPTTL PADCFG1bits.PMPTTL
#define _RTSECSEL PADCFG1bits.RTSECSEL


/* ---------------------------------------------------------- */
/* Some useful macros for inline assembler instructions       */
/* ---------------------------------------------------------- */

#define Nop()    __builtin_nop()
#define ClrWdt() {__asm__ volatile ("clrwdt");}
#define Sleep()  {__asm__ volatile ("pwrsav #0");}
#define Idle()   {__asm__ volatile ("pwrsav #1");}

/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array in X memory */
/* that is aligned to a 32 byte address:                      */
/*                                                            */
/* int _XBSS(32) xbuf[16];                                    */
/*                                                            */
#define _XBSS(N)    __attribute__((space(xmemory),far,aligned(N)))
#define _XDATA(N)   __attribute__((space(xmemory),far,aligned(N)))
#define _YBSS(N)    __attribute__((space(ymemory),far,aligned(N)))
#define _YDATA(N)   __attribute__((space(ymemory),far,aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

